app/controllers/customers_controller.rb

  def index
    @q = Customer.search(params[:q])
    @customers = @q.result(distinct: true).page(params[:page])
---
SELECT DISTINCT COUNT(DISTINCT "customers"."id") FROM "customers"